Revit 2024 API
PointCloudOverrides.ArePointCloudOverrideSettingsValid Method
 Checks if PointCloudOverrideSettings are valid
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static bool ArePointCloudOverrideSettingsValid(
	string tag,
	PointCloudOverrideSettings settings
)
Visual Basic
Public Shared Function ArePointCloudOverrideSettingsValid ( _
	tag As String, _
	settings As PointCloudOverrideSettings _
) As Boolean
Visual C++
public:
static bool ArePointCloudOverrideSettingsValid(
	String^ tag,
	PointCloudOverrideSettings^ settings
)
Parameters
tag
Type: System.String
 The tag identifying the particular scan/region within the PointCloudInstance element. Tags can be obtained from PointCloudInstance via method getScans/getRegions.
settings
Type: Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings
 Override settings to be checked.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PointCloudOverrides Class
Autodesk.Revit.DB.PointClouds Namespace